> **git commit -am "text"** -  команда сочетающая в себе одновременно **git add .** и **git commit -m "..."** > **git branch** - команда, с помощью которой можно просмотреть список всех имеющихся веток в нашем репозитории

Чтобы создать новую ветку, использвуем команду:
> **git branch branch_name** - создание ветки с именем branch_name

> **git checkout -b branch_name** - сокращенная команда, объединяющая в себе **git branch** и **git checkout branch_name**

> **git commit -am "text"** -  команда сочетающая в себе одновременно команду **git add .** и **git commit -m "..."**

> **git branch -D** - команда позволяющая удалить ветку без **merge**

> **git log** - команда вывода на экран истории всех коммитов с их хэш_кодами

> **git log --graph** - команда просмотра коммитов с визуализацией
> **git checkout -b branch_name** - сокращенная команда, объединяющая в себе **git branch** и **git checkout branch_name**
 
 > **git clone <url-адрес репозитория>**  – команда для клонирования внешнего репозитория на
локальный ПК

> **git pull** – команда для получения изменений и слияние с локальной версией

> **git push** – команда отправляет локальную версию репозитория на внешний